program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.2"}})]
{
    func main<ios16>(tensor<fp16, [1, 512, 128]> desc0, tensor<fp16, [1, 512, 128]> desc1, tensor<fp16, [1, 512, 2]> kpts0, tensor<fp16, [1, 512, 2]> kpts1, tensor<fp16, [1, 512]> oris0, tensor<fp16, [1, 512]> oris1, tensor<fp16, [1, 512]> scales0, tensor<fp16, [1, 512]> scales1) {
            tensor<int32, []> var_29 = const()[name = tensor<string, []>("op_29"), val = tensor<int32, []>(2)];
            tensor<int32, []> var_30 = const()[name = tensor<string, []>("op_30"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_31 = const()[name = tensor<string, []>("op_31"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 1, 2]> var_65_to_fp16 = const()[name = tensor<string, []>("op_65_to_fp16"), val = tensor<fp16, [1, 1, 2]>([[[0x1.ep+8, 0x1.68p+8]]])];
            tensor<fp16, [1, 512, 2]> var_67_cast_fp16 = sub(x = kpts0, y = var_65_to_fp16)[name = tensor<string, []>("op_67_cast_fp16")];
            tensor<fp16, [1, 1, 1]> _inversed_70_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_70_y_0_to_fp16"), val = tensor<fp16, [1, 1, 1]>([[[0x1.11p-9]]])];
            tensor<fp16, [1, 512, 2]> _inversed_70_cast_fp16 = mul(x = var_67_cast_fp16, y = _inversed_70_y_0_to_fp16)[name = tensor<string, []>("_inversed_70_cast_fp16")];
            tensor<fp16, [1, 1, 2]> var_79_to_fp16 = const()[name = tensor<string, []>("op_79_to_fp16"), val = tensor<fp16, [1, 1, 2]>([[[0x1.ep+8, 0x1.68p+8]]])];
            tensor<fp16, [1, 512, 2]> var_81_cast_fp16 = sub(x = kpts1, y = var_79_to_fp16)[name = tensor<string, []>("op_81_cast_fp16")];
            tensor<fp16, [1, 1, 1]> _inversed_84_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_84_y_0_to_fp16"), val = tensor<fp16, [1, 1, 1]>([[[0x1.11p-9]]])];
            tensor<fp16, [1, 512, 2]> _inversed_84_cast_fp16 = mul(x = var_81_cast_fp16, y = _inversed_84_y_0_to_fp16)[name = tensor<string, []>("_inversed_84_cast_fp16")];
            tensor<int32, [1]> var_86_axes_0 = const()[name = tensor<string, []>("op_86_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 512, 1]> var_86_cast_fp16 = expand_dims(axes = var_86_axes_0, x = scales0)[name = tensor<string, []>("op_86_cast_fp16")];
            tensor<int32, [1]> var_87_axes_0 = const()[name = tensor<string, []>("op_87_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 512, 1]> var_87_cast_fp16 = expand_dims(axes = var_87_axes_0, x = oris0)[name = tensor<string, []>("op_87_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 4]> input_5_cast_fp16 = concat(axis = var_31, interleave = input_5_interleave_0, values = (_inversed_70_cast_fp16, var_86_cast_fp16, var_87_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> var_90_axes_0 = const()[name = tensor<string, []>("op_90_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 512, 1]> var_90_cast_fp16 = expand_dims(axes = var_90_axes_0, x = scales1)[name = tensor<string, []>("op_90_cast_fp16")];
            tensor<int32, [1]> var_91_axes_0 = const()[name = tensor<string, []>("op_91_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 512, 1]> var_91_cast_fp16 = expand_dims(axes = var_91_axes_0, x = oris1)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<bool, []> input_7_interleave_0 = const()[name = tensor<string, []>("input_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 4]> input_7_cast_fp16 = concat(axis = var_31, interleave = input_7_interleave_0, values = (_inversed_84_cast_fp16, var_90_cast_fp16, var_91_cast_fp16))[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [256, 128]> lg_input_proj_weight_to_fp16 = const()[name = tensor<string, []>("lg_input_proj_weight_to_fp16"), val = tensor<fp16, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [256]> lg_input_proj_bias_to_fp16 = const()[name = tensor<string, []>("lg_input_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65664)))];
            tensor<fp16, [1, 512, 256]> linear_0_cast_fp16 = linear(bias = lg_input_proj_bias_to_fp16, weight = lg_input_proj_weight_to_fp16, x = desc0)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [1, 512, 256]> linear_1_cast_fp16 = linear(bias = lg_input_proj_bias_to_fp16, weight = lg_input_proj_weight_to_fp16, x = desc1)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [32, 4]> lg_posenc_Wr_weight_to_fp16 = const()[name = tensor<string, []>("lg_posenc_Wr_weight_to_fp16"), val = tensor<fp16, [32, 4]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66240)))];
            tensor<fp16, [32]> linear_2_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_2_bias_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66560)))];
            tensor<fp16, [1, 512, 32]> linear_2_cast_fp16 = linear(bias = linear_2_bias_0_to_fp16, weight = lg_posenc_Wr_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<fp16, [1, 512, 32]> cosines_1_cast_fp16 = cos(x = linear_2_cast_fp16)[name = tensor<string, []>("cosines_1_cast_fp16")];
            tensor<fp16, [1, 512, 32]> sines_1_cast_fp16 = sin(x = linear_2_cast_fp16)[name = tensor<string, []>("sines_1_cast_fp16")];
            tensor<int32, []> var_110_axis_0 = const()[name = tensor<string, []>("op_110_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 1, 512, 32]> var_110_cast_fp16 = stack(axis = var_110_axis_0, values = (cosines_1_cast_fp16, sines_1_cast_fp16))[name = tensor<string, []>("op_110_cast_fp16")];
            tensor<int32, [1]> emb_1_axes_0 = const()[name = tensor<string, []>("emb_1_axes_0"), val = tensor<int32, [1]>([-3])];
            tensor<fp16, [2, 1, 1, 512, 32]> emb_1_cast_fp16 = expand_dims(axes = emb_1_axes_0, x = var_110_cast_fp16)[name = tensor<string, []>("emb_1_cast_fp16")];
            tensor<int32, [5]> transpose_0_perm_0 = const()[name = tensor<string, []>("transpose_0_perm_0"), val = tensor<int32, [5]>([4, 0, 1, 2, 3])];
            tensor<int32, [5]> tile_0_reps_0 = const()[name = tensor<string, []>("tile_0_reps_0"), val = tensor<int32, [5]>([2, 1, 1, 1, 1])];
            tensor<fp16, [32, 2, 1, 1, 512]> transpose_0_cast_fp16 = transpose(perm = transpose_0_perm_0, x = emb_1_cast_fp16)[name = tensor<string, []>("transpose_205")];
            tensor<fp16, [64, 2, 1, 1, 512]> tile_0_cast_fp16 = tile(reps = tile_0_reps_0, x = transpose_0_cast_fp16)[name = tensor<string, []>("tile_0_cast_fp16")];
            tensor<int32, [3]> reshape_49_shape_0 = const()[name = tensor<string, []>("reshape_49_shape_0"), val = tensor<int32, [3]>([2, 32, 1024])];
            tensor<fp16, [2, 32, 1024]> reshape_49_cast_fp16 = reshape(shape = reshape_49_shape_0, x = tile_0_cast_fp16)[name = tensor<string, []>("reshape_49_cast_fp16")];
            tensor<int32, [3]> transpose_60_perm_0 = const()[name = tensor<string, []>("transpose_60_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [5]> reshape_50_shape_0 = const()[name = tensor<string, []>("reshape_50_shape_0"), val = tensor<int32, [5]>([-1, 2, 1, 1, 512])];
            tensor<fp16, [32, 2, 1024]> transpose_60_cast_fp16 = transpose(perm = transpose_60_perm_0, x = reshape_49_cast_fp16)[name = tensor<string, []>("transpose_204")];
            tensor<fp16, [64, 2, 1, 1, 512]> reshape_50_cast_fp16 = reshape(shape = reshape_50_shape_0, x = transpose_60_cast_fp16)[name = tensor<string, []>("reshape_50_cast_fp16")];
            tensor<int32, [5]> freqs_1_perm_0 = const()[name = tensor<string, []>("freqs_1_perm_0"), val = tensor<int32, [5]>([1, 2, 3, 4, 0])];
            tensor<fp16, [32]> linear_3_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_3_bias_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66688)))];
            tensor<fp16, [1, 512, 32]> linear_3_cast_fp16 = linear(bias = linear_3_bias_0_to_fp16, weight = lg_posenc_Wr_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 512, 32]> cosines_cast_fp16 = cos(x = linear_3_cast_fp16)[name = tensor<string, []>("cosines_cast_fp16")];
            tensor<fp16, [1, 512, 32]> sines_cast_fp16 = sin(x = linear_3_cast_fp16)[name = tensor<string, []>("sines_cast_fp16")];
            tensor<int32, []> var_119_axis_0 = const()[name = tensor<string, []>("op_119_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 1, 512, 32]> var_119_cast_fp16 = stack(axis = var_119_axis_0, values = (cosines_cast_fp16, sines_cast_fp16))[name = tensor<string, []>("op_119_cast_fp16")];
            tensor<int32, [1]> emb_axes_0 = const()[name = tensor<string, []>("emb_axes_0"), val = tensor<int32, [1]>([-3])];
            tensor<fp16, [2, 1, 1, 512, 32]> emb_cast_fp16 = expand_dims(axes = emb_axes_0, x = var_119_cast_fp16)[name = tensor<string, []>("emb_cast_fp16")];
            tensor<int32, [5]> transpose_2_perm_0 = const()[name = tensor<string, []>("transpose_2_perm_0"), val = tensor<int32, [5]>([4, 0, 1, 2, 3])];
            tensor<int32, [5]> tile_1_reps_0 = const()[name = tensor<string, []>("tile_1_reps_0"), val = tensor<int32, [5]>([2, 1, 1, 1, 1])];
            tensor<fp16, [32, 2, 1, 1, 512]> transpose_2_cast_fp16 = transpose(perm = transpose_2_perm_0, x = emb_cast_fp16)[name = tensor<string, []>("transpose_202")];
            tensor<fp16, [64, 2, 1, 1, 512]> tile_1_cast_fp16 = tile(reps = tile_1_reps_0, x = transpose_2_cast_fp16)[name = tensor<string, []>("tile_1_cast_fp16")];
            tensor<int32, [3]> reshape_51_shape_0 = const()[name = tensor<string, []>("reshape_51_shape_0"), val = tensor<int32, [3]>([2, 32, 1024])];
            tensor<fp16, [2, 32, 1024]> reshape_51_cast_fp16 = reshape(shape = reshape_51_shape_0, x = tile_1_cast_fp16)[name = tensor<string, []>("reshape_51_cast_fp16")];
            tensor<int32, [3]> transpose_61_perm_0 = const()[name = tensor<string, []>("transpose_61_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [5]> reshape_52_shape_0 = const()[name = tensor<string, []>("reshape_52_shape_0"), val = tensor<int32, [5]>([-1, 2, 1, 1, 512])];
            tensor<fp16, [32, 2, 1024]> transpose_61_cast_fp16 = transpose(perm = transpose_61_perm_0, x = reshape_51_cast_fp16)[name = tensor<string, []>("transpose_201")];
            tensor<fp16, [64, 2, 1, 1, 512]> reshape_52_cast_fp16 = reshape(shape = reshape_52_shape_0, x = transpose_61_cast_fp16)[name = tensor<string, []>("reshape_52_cast_fp16")];
            tensor<int32, [5]> freqs_perm_0 = const()[name = tensor<string, []>("freqs_perm_0"), val = tensor<int32, [5]>([1, 2, 3, 4, 0])];
            tensor<fp16, [768, 256]> lg_transformers_0_self_attn_Wqkv_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_Wqkv_weight_to_fp16"), val = tensor<fp16, [768, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66816)))];
            tensor<fp16, [768]> lg_transformers_0_self_attn_Wqkv_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_Wqkv_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(460096)))];
            tensor<fp16, [1, 512, 768]> linear_4_cast_fp16 = linear(bias = lg_transformers_0_self_attn_Wqkv_bias_to_fp16, weight = lg_transformers_0_self_attn_Wqkv_weight_to_fp16, x = linear_0_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [5]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [5]>([1, 512, 4, -1, 3])];
            tensor<fp16, [1, 512, 4, 64, 3]> var_131_cast_fp16 = reshape(shape = concat_4, x = linear_4_cast_fp16)[name = tensor<string, []>("op_131_cast_fp16")];
            tensor<int32, [5]> qkv_1_perm_0 = const()[name = tensor<string, []>("qkv_1_perm_0"), val = tensor<int32, [5]>([0, 2, 1, 3, 4])];
            tensor<int32, [5]> t_1_begin_0 = const()[name = tensor<string, []>("t_1_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> t_1_end_0 = const()[name = tensor<string, []>("t_1_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 1])];
            tensor<bool, [5]> t_1_end_mask_0 = const()[name = tensor<string, []>("t_1_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> t_1_squeeze_mask_0 = const()[name = tensor<string, []>("t_1_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64, 3]> qkv_1_cast_fp16 = transpose(perm = qkv_1_perm_0, x = var_131_cast_fp16)[name = tensor<string, []>("transpose_199")];
            tensor<fp16, [1, 4, 512, 64]> t_1_cast_fp16 = slice_by_index(begin = t_1_begin_0, end = t_1_end_0, end_mask = t_1_end_mask_0, squeeze_mask = t_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("t_1_cast_fp16")];
            tensor<int32, [5]> t_3_begin_0 = const()[name = tensor<string, []>("t_3_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> t_3_end_0 = const()[name = tensor<string, []>("t_3_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 2])];
            tensor<bool, [5]> t_3_end_mask_0 = const()[name = tensor<string, []>("t_3_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> t_3_squeeze_mask_0 = const()[name = tensor<string, []>("t_3_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64]> t_3_cast_fp16 = slice_by_index(begin = t_3_begin_0, end = t_3_end_0, end_mask = t_3_end_mask_0, squeeze_mask = t_3_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("t_3_cast_fp16")];
            tensor<int32, [5]> v_1_begin_0 = const()[name = tensor<string, []>("v_1_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 2])];
            tensor<int32, [5]> v_1_end_0 = const()[name = tensor<string, []>("v_1_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 3])];
            tensor<bool, [5]> v_1_end_mask_0 = const()[name = tensor<string, []>("v_1_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> v_1_squeeze_mask_0 = const()[name = tensor<string, []>("v_1_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64]> v_1_cast_fp16 = slice_by_index(begin = v_1_begin_0, end = v_1_end_0, end_mask = v_1_end_mask_0, squeeze_mask = v_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("v_1_cast_fp16")];
            tensor<int32, [5]> var_136_begin_0 = const()[name = tensor<string, []>("op_136_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_136_end_0 = const()[name = tensor<string, []>("op_136_end_0"), val = tensor<int32, [5]>([1, 1, 1, 512, 64])];
            tensor<bool, [5]> var_136_end_mask_0 = const()[name = tensor<string, []>("op_136_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_136_squeeze_mask_0 = const()[name = tensor<string, []>("op_136_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [2, 1, 1, 512, 64]> freqs_1_cast_fp16 = transpose(perm = freqs_1_perm_0, x = reshape_50_cast_fp16)[name = tensor<string, []>("transpose_203")];
            tensor<fp16, [1, 1, 512, 64]> var_136_cast_fp16 = slice_by_index(begin = var_136_begin_0, end = var_136_end_0, end_mask = var_136_end_mask_0, squeeze_mask = var_136_squeeze_mask_0, x = freqs_1_cast_fp16)[name = tensor<string, []>("op_136_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_137_cast_fp16 = mul(x = t_1_cast_fp16, y = var_136_cast_fp16)[name = tensor<string, []>("op_137_cast_fp16")];
            tensor<int32, [5]> concat_5 = const()[name = tensor<string, []>("concat_5"), val = tensor<int32, [5]>([1, 4, 512, -1, 2])];
            tensor<fp16, [1, 4, 512, 32, 2]> x_1_cast_fp16 = reshape(shape = concat_5, x = t_1_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [2]> var_140_split_sizes_0 = const()[name = tensor<string, []>("op_140_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_140_axis_0 = const()[name = tensor<string, []>("op_140_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 1]> var_140_cast_fp16_0, tensor<fp16, [1, 4, 512, 32, 1]> var_140_cast_fp16_1 = split(axis = var_140_axis_0, split_sizes = var_140_split_sizes_0, x = x_1_cast_fp16)[name = tensor<string, []>("op_140_cast_fp16")];
            tensor<int32, [1]> squeeze_0_axes_0 = const()[name = tensor<string, []>("squeeze_0_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_0_cast_fp16 = squeeze(axes = squeeze_0_axes_0, x = var_140_cast_fp16_0)[name = tensor<string, []>("squeeze_0_cast_fp16")];
            tensor<int32, [1]> squeeze_1_axes_0 = const()[name = tensor<string, []>("squeeze_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_1_cast_fp16 = squeeze(axes = squeeze_1_axes_0, x = var_140_cast_fp16_1)[name = tensor<string, []>("squeeze_1_cast_fp16")];
            tensor<fp16, []> const_2_promoted_to_fp16 = const()[name = tensor<string, []>("const_2_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 4, 512, 32]> var_143_cast_fp16 = mul(x = squeeze_1_cast_fp16, y = const_2_promoted_to_fp16)[name = tensor<string, []>("op_143_cast_fp16")];
            tensor<int32, []> var_145_axis_0 = const()[name = tensor<string, []>("op_145_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 2]> var_145_cast_fp16 = stack(axis = var_145_axis_0, values = (var_143_cast_fp16, squeeze_0_cast_fp16))[name = tensor<string, []>("op_145_cast_fp16")];
            tensor<int32, [4]> concat_6 = const()[name = tensor<string, []>("concat_6"), val = tensor<int32, [4]>([1, 4, 512, 64])];
            tensor<fp16, [1, 4, 512, 64]> var_146_cast_fp16 = reshape(shape = concat_6, x = var_145_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<int32, [5]> var_147_begin_0 = const()[name = tensor<string, []>("op_147_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> var_147_end_0 = const()[name = tensor<string, []>("op_147_end_0"), val = tensor<int32, [5]>([2, 1, 1, 512, 64])];
            tensor<bool, [5]> var_147_end_mask_0 = const()[name = tensor<string, []>("op_147_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_147_squeeze_mask_0 = const()[name = tensor<string, []>("op_147_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 1, 512, 64]> var_147_cast_fp16 = slice_by_index(begin = var_147_begin_0, end = var_147_end_0, end_mask = var_147_end_mask_0, squeeze_mask = var_147_squeeze_mask_0, x = freqs_1_cast_fp16)[name = tensor<string, []>("op_147_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_148_cast_fp16 = mul(x = var_146_cast_fp16, y = var_147_cast_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> q_1_cast_fp16 = add(x = var_137_cast_fp16, y = var_148_cast_fp16)[name = tensor<string, []>("q_1_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_151_cast_fp16 = mul(x = t_3_cast_fp16, y = var_136_cast_fp16)[name = tensor<string, []>("op_151_cast_fp16")];
            tensor<int32, [5]> concat_7 = const()[name = tensor<string, []>("concat_7"), val = tensor<int32, [5]>([1, 4, 512, -1, 2])];
            tensor<fp16, [1, 4, 512, 32, 2]> x_3_cast_fp16 = reshape(shape = concat_7, x = t_3_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [2]> var_154_split_sizes_0 = const()[name = tensor<string, []>("op_154_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_154_axis_0 = const()[name = tensor<string, []>("op_154_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 1]> var_154_cast_fp16_0, tensor<fp16, [1, 4, 512, 32, 1]> var_154_cast_fp16_1 = split(axis = var_154_axis_0, split_sizes = var_154_split_sizes_0, x = x_3_cast_fp16)[name = tensor<string, []>("op_154_cast_fp16")];
            tensor<int32, [1]> squeeze_2_axes_0 = const()[name = tensor<string, []>("squeeze_2_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_2_cast_fp16 = squeeze(axes = squeeze_2_axes_0, x = var_154_cast_fp16_0)[name = tensor<string, []>("squeeze_2_cast_fp16")];
            tensor<int32, [1]> squeeze_3_axes_0 = const()[name = tensor<string, []>("squeeze_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_3_cast_fp16 = squeeze(axes = squeeze_3_axes_0, x = var_154_cast_fp16_1)[name = tensor<string, []>("squeeze_3_cast_fp16")];
            tensor<fp16, []> const_3_promoted_to_fp16 = const()[name = tensor<string, []>("const_3_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 4, 512, 32]> var_157_cast_fp16 = mul(x = squeeze_3_cast_fp16, y = const_3_promoted_to_fp16)[name = tensor<string, []>("op_157_cast_fp16")];
            tensor<int32, []> var_159_axis_0 = const()[name = tensor<string, []>("op_159_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 2]> var_159_cast_fp16 = stack(axis = var_159_axis_0, values = (var_157_cast_fp16, squeeze_2_cast_fp16))[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<int32, [4]> concat_8 = const()[name = tensor<string, []>("concat_8"), val = tensor<int32, [4]>([1, 4, 512, 64])];
            tensor<fp16, [1, 4, 512, 64]> var_160_cast_fp16 = reshape(shape = concat_8, x = var_159_cast_fp16)[name = tensor<string, []>("op_160_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_162_cast_fp16 = mul(x = var_160_cast_fp16, y = var_147_cast_fp16)[name = tensor<string, []>("op_162_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> k_1_cast_fp16 = add(x = var_151_cast_fp16, y = var_162_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 4, 512, 64]> mul_0_cast_fp16 = mul(x = q_1_cast_fp16, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 512, 512]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = mul_0_cast_fp16, y = k_1_cast_fp16)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 512]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> context_1_transpose_x_0 = const()[name = tensor<string, []>("context_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_1_transpose_y_0 = const()[name = tensor<string, []>("context_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 512, 64]> context_1_cast_fp16 = matmul(transpose_x = context_1_transpose_x_0, transpose_y = context_1_transpose_y_0, x = softmax_0_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("context_1_cast_fp16")];
            tensor<int32, [4]> var_168_perm_0 = const()[name = tensor<string, []>("op_168_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_9 = const()[name = tensor<string, []>("concat_9"), val = tensor<int32, [3]>([1, 512, 256])];
            tensor<fp16, [1, 512, 4, 64]> var_168_cast_fp16 = transpose(perm = var_168_perm_0, x = context_1_cast_fp16)[name = tensor<string, []>("transpose_198")];
            tensor<fp16, [1, 512, 256]> input_11_cast_fp16 = reshape(shape = concat_9, x = var_168_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [256, 256]> lg_transformers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(461696)))];
            tensor<fp16, [256]> lg_transformers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(592832)))];
            tensor<fp16, [1, 512, 256]> linear_5_cast_fp16 = linear(bias = lg_transformers_0_self_attn_out_proj_bias_to_fp16, weight = lg_transformers_0_self_attn_out_proj_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<bool, []> input_13_interleave_0 = const()[name = tensor<string, []>("input_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 512]> input_13_cast_fp16 = concat(axis = var_31, interleave = input_13_interleave_0, values = (linear_0_cast_fp16, linear_5_cast_fp16))[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [512, 512]> lg_transformers_0_self_attn_ffn_0_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_0_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(593408)))];
            tensor<fp16, [512]> lg_transformers_0_self_attn_ffn_0_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_0_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1117760)))];
            tensor<fp16, [1, 512, 512]> linear_6_cast_fp16 = linear(bias = lg_transformers_0_self_attn_ffn_0_bias_to_fp16, weight = lg_transformers_0_self_attn_ffn_0_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [1]> input_17_axes_0 = const()[name = tensor<string, []>("input_17_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [512]> lg_transformers_0_self_attn_ffn_1_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_1_weight_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1118848)))];
            tensor<fp16, [512]> lg_transformers_0_self_attn_ffn_1_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1119936)))];
            tensor<fp16, []> var_16_to_fp16 = const()[name = tensor<string, []>("op_16_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 512]> input_17_cast_fp16 = layer_norm(axes = input_17_axes_0, beta = lg_transformers_0_self_attn_ffn_1_bias_to_fp16, epsilon = var_16_to_fp16, gamma = lg_transformers_0_self_attn_ffn_1_weight_to_fp16, x = linear_6_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_mode_0 = const()[name = tensor<string, []>("input_19_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 512]> input_19_cast_fp16 = gelu(mode = input_19_mode_0, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [256, 512]> lg_transformers_0_self_attn_ffn_3_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_3_weight_to_fp16"), val = tensor<fp16, [256, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1121024)))];
            tensor<fp16, [256]> lg_transformers_0_self_attn_ffn_3_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_self_attn_ffn_3_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1383232)))];
            tensor<fp16, [1, 512, 256]> linear_7_cast_fp16 = linear(bias = lg_transformers_0_self_attn_ffn_3_bias_to_fp16, weight = lg_transformers_0_self_attn_ffn_3_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, 512, 256]> input_33_cast_fp16 = add(x = linear_0_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 512, 768]> linear_8_cast_fp16 = linear(bias = lg_transformers_0_self_attn_Wqkv_bias_to_fp16, weight = lg_transformers_0_self_attn_Wqkv_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [5]> concat_10 = const()[name = tensor<string, []>("concat_10"), val = tensor<int32, [5]>([1, 512, 4, -1, 3])];
            tensor<fp16, [1, 512, 4, 64, 3]> var_197_cast_fp16 = reshape(shape = concat_10, x = linear_8_cast_fp16)[name = tensor<string, []>("op_197_cast_fp16")];
            tensor<int32, [5]> qkv_3_perm_0 = const()[name = tensor<string, []>("qkv_3_perm_0"), val = tensor<int32, [5]>([0, 2, 1, 3, 4])];
            tensor<int32, [5]> t_5_begin_0 = const()[name = tensor<string, []>("t_5_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> t_5_end_0 = const()[name = tensor<string, []>("t_5_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 1])];
            tensor<bool, [5]> t_5_end_mask_0 = const()[name = tensor<string, []>("t_5_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> t_5_squeeze_mask_0 = const()[name = tensor<string, []>("t_5_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64, 3]> qkv_3_cast_fp16 = transpose(perm = qkv_3_perm_0, x = var_197_cast_fp16)[name = tensor<string, []>("transpose_197")];
            tensor<fp16, [1, 4, 512, 64]> t_5_cast_fp16 = slice_by_index(begin = t_5_begin_0, end = t_5_end_0, end_mask = t_5_end_mask_0, squeeze_mask = t_5_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("t_5_cast_fp16")];
            tensor<int32, [5]> t_7_begin_0 = const()[name = tensor<string, []>("t_7_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> t_7_end_0 = const()[name = tensor<string, []>("t_7_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 2])];
            tensor<bool, [5]> t_7_end_mask_0 = const()[name = tensor<string, []>("t_7_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> t_7_squeeze_mask_0 = const()[name = tensor<string, []>("t_7_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64]> t_7_cast_fp16 = slice_by_index(begin = t_7_begin_0, end = t_7_end_0, end_mask = t_7_end_mask_0, squeeze_mask = t_7_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("t_7_cast_fp16")];
            tensor<int32, [5]> v_3_begin_0 = const()[name = tensor<string, []>("v_3_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 2])];
            tensor<int32, [5]> v_3_end_0 = const()[name = tensor<string, []>("v_3_end_0"), val = tensor<int32, [5]>([1, 4, 512, 64, 3])];
            tensor<bool, [5]> v_3_end_mask_0 = const()[name = tensor<string, []>("v_3_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> v_3_squeeze_mask_0 = const()[name = tensor<string, []>("v_3_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1, 4, 512, 64]> v_3_cast_fp16 = slice_by_index(begin = v_3_begin_0, end = v_3_end_0, end_mask = v_3_end_mask_0, squeeze_mask = v_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("v_3_cast_fp16")];
            tensor<int32, [5]> var_202_begin_0 = const()[name = tensor<string, []>("op_202_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_202_end_0 = const()[name = tensor<string, []>("op_202_end_0"), val = tensor<int32, [5]>([1, 1, 1, 512, 64])];
            tensor<bool, [5]> var_202_end_mask_0 = const()[name = tensor<string, []>("op_202_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_202_squeeze_mask_0 = const()[name = tensor<string, []>("op_202_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [2, 1, 1, 512, 64]> freqs_cast_fp16 = transpose(perm = freqs_perm_0, x = reshape_52_cast_fp16)[name = tensor<string, []>("transpose_200")];
            tensor<fp16, [1, 1, 512, 64]> var_202_cast_fp16 = slice_by_index(begin = var_202_begin_0, end = var_202_end_0, end_mask = var_202_end_mask_0, squeeze_mask = var_202_squeeze_mask_0, x = freqs_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_203_cast_fp16 = mul(x = t_5_cast_fp16, y = var_202_cast_fp16)[name = tensor<string, []>("op_203_cast_fp16")];
            tensor<int32, [5]> concat_11 = const()[name = tensor<string, []>("concat_11"), val = tensor<int32, [5]>([1, 4, 512, -1, 2])];
            tensor<fp16, [1, 4, 512, 32, 2]> x_5_cast_fp16 = reshape(shape = concat_11, x = t_5_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [2]> var_206_split_sizes_0 = const()[name = tensor<string, []>("op_206_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_206_axis_0 = const()[name = tensor<string, []>("op_206_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 1]> var_206_cast_fp16_0, tensor<fp16, [1, 4, 512, 32, 1]> var_206_cast_fp16_1 = split(axis = var_206_axis_0, split_sizes = var_206_split_sizes_0, x = x_5_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [1]> squeeze_4_axes_0 = const()[name = tensor<string, []>("squeeze_4_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_4_cast_fp16 = squeeze(axes = squeeze_4_axes_0, x = var_206_cast_fp16_0)[name = tensor<string, []>("squeeze_4_cast_fp16")];
            tensor<int32, [1]> squeeze_5_axes_0 = const()[name = tensor<string, []>("squeeze_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_5_cast_fp16 = squeeze(axes = squeeze_5_axes_0, x = var_206_cast_fp16_1)[name = tensor<string, []>("squeeze_5_cast_fp16")];
            tensor<fp16, []> const_4_promoted_to_fp16 = const()[name = tensor<string, []>("const_4_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 4, 512, 32]> var_209_cast_fp16 = mul(x = squeeze_5_cast_fp16, y = const_4_promoted_to_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<int32, []> var_211_axis_0 = const()[name = tensor<string, []>("op_211_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 2]> var_211_cast_fp16 = stack(axis = var_211_axis_0, values = (var_209_cast_fp16, squeeze_4_cast_fp16))[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<int32, [4]> concat_12 = const()[name = tensor<string, []>("concat_12"), val = tensor<int32, [4]>([1, 4, 512, 64])];
            tensor<fp16, [1, 4, 512, 64]> var_212_cast_fp16 = reshape(shape = concat_12, x = var_211_cast_fp16)[name = tensor<string, []>("op_212_cast_fp16")];
            tensor<int32, [5]> var_213_begin_0 = const()[name = tensor<string, []>("op_213_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> var_213_end_0 = const()[name = tensor<string, []>("op_213_end_0"), val = tensor<int32, [5]>([2, 1, 1, 512, 64])];
            tensor<bool, [5]> var_213_end_mask_0 = const()[name = tensor<string, []>("op_213_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_213_squeeze_mask_0 = const()[name = tensor<string, []>("op_213_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 1, 512, 64]> var_213_cast_fp16 = slice_by_index(begin = var_213_begin_0, end = var_213_end_0, end_mask = var_213_end_mask_0, squeeze_mask = var_213_squeeze_mask_0, x = freqs_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_214_cast_fp16 = mul(x = var_212_cast_fp16, y = var_213_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> q_3_cast_fp16 = add(x = var_203_cast_fp16, y = var_214_cast_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_217_cast_fp16 = mul(x = t_7_cast_fp16, y = var_202_cast_fp16)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<int32, [5]> concat_13 = const()[name = tensor<string, []>("concat_13"), val = tensor<int32, [5]>([1, 4, 512, -1, 2])];
            tensor<fp16, [1, 4, 512, 32, 2]> x_7_cast_fp16 = reshape(shape = concat_13, x = t_7_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [2]> var_220_split_sizes_0 = const()[name = tensor<string, []>("op_220_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_220_axis_0 = const()[name = tensor<string, []>("op_220_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 1]> var_220_cast_fp16_0, tensor<fp16, [1, 4, 512, 32, 1]> var_220_cast_fp16_1 = split(axis = var_220_axis_0, split_sizes = var_220_split_sizes_0, x = x_7_cast_fp16)[name = tensor<string, []>("op_220_cast_fp16")];
            tensor<int32, [1]> squeeze_6_axes_0 = const()[name = tensor<string, []>("squeeze_6_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_6_cast_fp16 = squeeze(axes = squeeze_6_axes_0, x = var_220_cast_fp16_0)[name = tensor<string, []>("squeeze_6_cast_fp16")];
            tensor<int32, [1]> squeeze_7_axes_0 = const()[name = tensor<string, []>("squeeze_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 4, 512, 32]> squeeze_7_cast_fp16 = squeeze(axes = squeeze_7_axes_0, x = var_220_cast_fp16_1)[name = tensor<string, []>("squeeze_7_cast_fp16")];
            tensor<fp16, []> const_5_promoted_to_fp16 = const()[name = tensor<string, []>("const_5_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 4, 512, 32]> var_223_cast_fp16 = mul(x = squeeze_7_cast_fp16, y = const_5_promoted_to_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<int32, []> var_225_axis_0 = const()[name = tensor<string, []>("op_225_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 32, 2]> var_225_cast_fp16 = stack(axis = var_225_axis_0, values = (var_223_cast_fp16, squeeze_6_cast_fp16))[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<int32, [4]> concat_14 = const()[name = tensor<string, []>("concat_14"), val = tensor<int32, [4]>([1, 4, 512, 64])];
            tensor<fp16, [1, 4, 512, 64]> var_226_cast_fp16 = reshape(shape = concat_14, x = var_225_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> var_228_cast_fp16 = mul(x = var_226_cast_fp16, y = var_213_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<fp16, [1, 4, 512, 64]> k_3_cast_fp16 = add(x = var_217_cast_fp16, y = var_228_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 4, 512, 64]> mul_1_cast_fp16 = mul(x = q_3_cast_fp16, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 512, 512]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = mul_1_cast_fp16, y = k_3_cast_fp16)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 512, 512]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> context_3_transpose_x_0 = const()[name = tensor<string, []>("context_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_3_transpose_y_0 = const()[name = tensor<string, []>("context_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 512, 64]> context_3_cast_fp16 = matmul(transpose_x = context_3_transpose_x_0, transpose_y = context_3_transpose_y_0, x = softmax_1_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("context_3_cast_fp16")];
            tensor<int32, [4]> var_234_perm_0 = const()[name = tensor<string, []>("op_234_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_15 = const()[name = tensor<string, []>("concat_15"), val = tensor<int32, [3]>([1, 512, 256])];
            tensor<fp16, [1, 512, 4, 64]> var_234_cast_fp16 = transpose(perm = var_234_perm_0, x = context_3_cast_fp16)[name = tensor<string, []>("transpose_196")];
            tensor<fp16, [1, 512, 256]> input_23_cast_fp16 = reshape(shape = concat_15, x = var_234_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 512, 256]> linear_9_cast_fp16 = linear(bias = lg_transformers_0_self_attn_out_proj_bias_to_fp16, weight = lg_transformers_0_self_attn_out_proj_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<bool, []> input_25_interleave_0 = const()[name = tensor<string, []>("input_25_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 512]> input_25_cast_fp16 = concat(axis = var_31, interleave = input_25_interleave_0, values = (linear_1_cast_fp16, linear_9_cast_fp16))[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 512, 512]> linear_10_cast_fp16 = linear(bias = lg_transformers_0_self_attn_ffn_0_bias_to_fp16, weight = lg_transformers_0_self_attn_ffn_0_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 512, 512]> input_29_cast_fp16 = layer_norm(axes = input_29_axes_0, beta = lg_transformers_0_self_attn_ffn_1_bias_to_fp16, epsilon = var_16_to_fp16, gamma = lg_transformers_0_self_attn_ffn_1_weight_to_fp16, x = linear_10_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_mode_0 = const()[name = tensor<string, []>("input_31_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 512]> input_31_cast_fp16 = gelu(mode = input_31_mode_0, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1, 512, 256]> linear_11_cast_fp16 = linear(bias = lg_transformers_0_self_attn_ffn_3_bias_to_fp16, weight = lg_transformers_0_self_attn_ffn_3_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 512, 256]> input_35_cast_fp16 = add(x = linear_1_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [256, 256]> lg_transformers_0_cross_attn_to_qk_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_cross_attn_to_qk_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1383808)))];
            tensor<fp16, [256]> lg_transformers_0_cross_attn_to_qk_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_cross_attn_to_qk_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1514944)))];
            tensor<fp16, [1, 512, 256]> linear_12_cast_fp16 = linear(bias = lg_transformers_0_cross_attn_to_qk_bias_to_fp16, weight = lg_transformers_0_cross_attn_to_qk_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [1, 512, 256]> linear_13_cast_fp16 = linear(bias = lg_transformers_0_cross_attn_to_qk_bias_to_fp16, weight = lg_transformers_0_cross_attn_to_qk_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [256, 256]> lg_transformers_0_cross_attn_to_v_weight_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_cross_attn_to_v_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1515520)))];
            tensor<fp16, [256]> lg_transformers_0_cross_attn_to_v_bias_to_fp16 = const()[name = tensor<string, []>("lg_transformers_0_cross_attn_to_v_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1646656)))];
            tensor<fp16, [1, 512, 256]> linear_14_cast_fp16 = linear(bias = lg_transformers_0_cross_attn_to_v_bias_to_fp16, weight = lg_transformers_0_cross_attn_to_v_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<fp16, [1, 512, 256]> linear_15_cast_fp16 = linear(bias = lg_transformers_0_cross_attn_to_v_bias_to_fp16, weight = lg_transformers_0_cross_attn_to_v_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<int32, [4]> concat_16 = const()[name = tensor<string, []>("concat_16"), val = tensor<int32, [4]>([1, 512, 4, -1])];
            tensor<fp16, [1, 512, 4, 64]> var_273_cast_fp16 = reshape(shape = concat_16, x = linear_12_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<int32, [4]> concat_17 = const()[name = tensor<string, []>("concat_17"), val = tensor<int32, [4]>([1, 512, 4, -1])];
            tensor<fp16, [1, 512, 4, 64]> var_276_cast_fp16 = reshape(shape = concat_17, x = linear_13_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<int32, [4]> concat_18 = const()[name = tensor<string, []>("concat_18"), val = tensor<int32, [4]>([1, 512, 4, -1])];
            tensor<fp16, [1, 512, 4, 64]> var_279_cast_fp16 = reshape(shape = concat_18, x = linear_14_cast_fp16)[name = tensor<string, []>("op_279_cast_fp16")];
            tensor<int32, [4]> concat_19 = const()[name = tensor<string, []>("concat_19"), val = tensor<int32, [4]>([1, 512, 4, -1])];
            tensor<fp16, [1, 512, 4, 64]> var_282_cast_fp16 = reshape(shape = concat_19, x = linear_15_cast_fp16)[name = tensor<string, []>("op_282_cast_fp16")];
            tensor<int32, [4]> var_283_perm_0 = const()[name = tensor<string, []>("op_283_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> var_284_to_fp16 = const()[name = tensor<string, []>("op_284_to_fp16"), val = tensor<fp16, []>(0x1.6ap-2)];
            tensor<fp16, [1, 512, 4, 64]> var_285_cast_fp16 = mul(x = var_273_cast_fp16, y = var_284_to_fp16)[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<fp16, []> var_286_to_fp16 = const()[name = tensor<string, []>("op_286_to_fp16"), val = tensor<fp16, []>(0x1.6ap-2)];
            tensor<fp16, [1, 512, 4, 64]> var_287_cast_fp16 = mul(x = var_276_cast_fp16, y = var_286_to_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<bool, []> input_37_transpose_x_0 = const()[name = tensor<string, []>("input_37_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_37_transpose_y_0 = const()[name = tensor<string, []>("input_37_transpose_y_0"), val = tensor<bool, []>(true)];
